# imgur key
Client_ID = '136ba95b9e20f1a'
Client_Secret = 'e4a1ae5ac1ee1f4d7127bcda84a532a69cf17c21'
Album_ID = 'YwmhNgW'
Access_Token = '343ea44e31f2b3dde5d5efe5f193481d9deb9ac3'
Refresh_Token = '9a0e5752675513f8564759b4eb603764502e51ac'

# line bot key
Channel_Access_Token = 'n3/oHFHwqZ2mQV7pUChishywh66Z9Z0F4uyxtNKj+RK3l4HPBPTgElS19HCK2yrmZW4CLPoyG8yzppQijdpQZ6xLd7Jm9QdOPoTkjRANyB7sB56Zq05UQt4cbmRAEQp1y3B3YBQwHczl/KdotYez8AdB04t89/1O/w1cDnyilFU='
Channel_Secret = 'ef2da7c9e8a366e6d2ade3eb64fcb8f9'

# food
Food_list = ['雞肉飯', '牛肉麵', '滷肉飯', '爌肉飯', '虱目魚', '魚丸湯', '四神湯', '黑白切',
             '蚵仔煎', '生炒花枝', '鹹粥', '肉羹', '肉粽', '油飯', '筒仔米糕', '炒麵', '炒米粉', '米粉湯',
             '肉圓', '碗粿', '貢丸', '切仔麵', '豬血糕', '麵線', '香雞排',
             '鹹酥雞', '排骨酥', '珍珠奶茶', '芒果冰', '漢堡王', '甜甜圈',
             '臭豆腐', '麻油雞', '鹽水雞', '薑母鴨', '藥燉排骨', '藥燉土虱', '當歸鴨', '東山鴨頭', '蔥油餅', '水煎包',
             '擔仔麵', '飯糰', '乾麵', '意麵', '粄條', '滷味', '臭臭鍋', '大腸包小腸', '黑輪', '豆乳雞',
             '蛋炒飯', '火雞肉飯', '糯米腸', '皮蛋瘦肉粥', '鍋燒麵', '雞捲', '烤魷魚', '蚵嗲', '炸粿', '扁食', '棺材板',
             '鱔魚炒麵', '蜈蚣蟳', '虱目魚湯', '乾煎虱目魚(肚)', '魷魚羹', '三杯田雞', '三杯花枝', '豆瓣魚', '豆酥魚',
             '三杯中卷', '客家小炒', '燒酒雞', '甕仔雞', '三杯雞', '涼拌鴨賞', '滷豬腳', '花生豬腳', '豬腳麵線',
             '藥燉排骨', '薑絲大腸', '糖醋排骨', '紅燒排骨', '蔥爆牛肉', '炒羊肉', '五更腸旺', '宮保皮蛋', '菜脯蛋',
             '九層塔烘蛋', '三色蛋', '鹹蛋苦瓜', '麻婆豆腐', '羊肉爐', '海鮮鍋', '麻辣火鍋', '鴛鴦鍋', '石頭火鍋',
             '車輪餅', '地瓜球', '章魚燒', '燒烤', '夜市牛排', '壽司', '布丁', '蛋塔', '骰子牛肉', '雞蛋糕', '潤餅捲',
             '營養三明治', '雞排', '水餃', '花生捲冰淇淋', '鹹水雞', '剉冰', '土', '屎', '燒酒螺', '滷味', '西北風', '麥當勞',
             '肯德基', '胖老爹', '兔兔', '自助餐', '沙威瑪', '生煎包', '泡麵', '生菜沙拉', '飯糰', '蛋餅']

# Bulletin
Bulletin = '每日宣導\n\n為了大家的勾玉著想，\n爭奪期間沒有指示或無法即時看Line的朋友們，\n請不要貿然攻擊大殿' \
           '或佔領任何城池。\n---\n門派技能一周開七次需要大量基金，為了大家的成長，\n請踴躍捐獻，每周至少1000門派基金。\n---\n討伐請多多支援\n這禮拜目前看起來有機會幹掉56等'
fight_Bulletin = '每日宣導\n\n今天是爭奪日，\n請到隔壁群報到或請假。\n另外為了大家的勾玉著想，\n爭奪期間沒有指示或無法即時看Line的朋友們，\n請不要貿然攻擊大殿' \
           '或佔領任何城池。\n---\n門派技能一周開七次需要大量基金，為了大家的成長，\n請踴躍捐獻，每周至少1000門派基金。\n---\n討伐請多多支援\n這禮拜目前看起來有機會幹掉56等'

# Horoscope
tw_horoscope = ['牡羊', '金牛', '雙子', '巨蟹', '獅子', '處女', '天秤', '天蠍', '射手', '摩羯', '水瓶', '雙魚']
en_horoscope = ['Aries', 'Taurus', 'Gemini', 'Cancer', 'Leo', 'Virgo', 'Libra', 'Scorpio', 'Sagittarius', 'Capricorn',
                'Aquarius', 'Pisces']
